Revit 2026 API

# SubTransaction Constructor

---

Instantiates a sub-transaction object

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SubTransaction(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
SubTransaction(
	Document^ document
)
```
```fsharp
new :
        document : Document -> SubTransaction
```

#### Parameters

document Document
     The document for which this sub-transaction is going to be used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SubTransaction Class

Autodesk.Revit.DB Namespace